Revit 2027 API
Fascia.FasciaType Property
Retrieves/set an object that represents the type of the Fascia.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FasciaType FasciaType { get; set; }
Public Property FasciaType As FasciaType
	Get
	Set
public:
property FasciaType^ FasciaType {
	FasciaType^ get ();
	void set (FasciaType^ value);
}
member FasciaType : FasciaType with get, set
Property Value
FasciaType
See Also
Reference
Fascia Class
Autodesk.Revit.DB.Architecture Namespace